Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དྲང་སྲོང་ཆེན་པོ་ཁྱོད་ཁྲིམས་འདྲ་བ་མེད།
en: Great Sage, no one has discipline like you.

source: །འགྲོ་བ་ཉོན་མོངས་རྣམ་པ་མང་ལས་ཁྲོལ།
en: Now you must free beings from their many afflictions.

source: །ཁྱོད་ཀྱིས་སྲིད་པ་བརྒྱར་ནི་བཟོད་པ་སྤྱད།
en: “For hundreds of lives you trained in forbearance;

source: །ཁྱོད་ནི་འགྲོ་བས་ངན་བརྗོད་རྣམ་མང་བཟོད།
en: You had patience with all kinds of evil words from others;

source: །བཟོད་པས་བཟོད་ཅིང་དུལ་བས་དེས་པའི་བདག །རྐང་གཉིས་དབང་པོ་མངོན་པར་འབྱུང་བློ་གྱིས།
en: Through patience you are forbearing, self-controlled, and at ease. Lord of Men, now you must decide to depart from home.

source: །ཁྱོད་བརྩོན་བརྟན་ཞིང་མི་གཡོ་གཡོ་བ་མེད། །བདེ་བར་གཤེགས་པ་སྔོན་མཐར་རྒྱ་ཆེན་གྱུར།
en: “Your diligence is firm, steadfast, and unshakable; Well-Gone One, you are great from beginning to end.

source: །གཡོན་ཅན་བདུད་ནི་སྡེ་དང་བཅས་བཏུལ་ཏེ།
en: Virtuous One, you will tame Māra, the evil one, and his army,

source: །ངན་སོང་གསུམ་པོ་མཐའ་དག་སྐམས་པར་གྱིས།
en: And dry up the entire three lower realms.

source: །གང་ཕྱིར་ཁྱོད་ཀྱིས་བརྟུལ་ཞུགས་དཀའ་ཐུབ་སྤྱད།
en: “This is why you have practiced disciplined conduct and austerities—

source: །དུས་ངན་ཉོན་མོངས་སྙིགས་མ་བསྲེགས་གྱིས་ལ།
en: To burn the afflictions of these evil and degenerate times.

source: །ཁྱོད་ཀྱིས་བདུད་རྩི་ཆུ་བོའི་ཆར་ཕོབ་སྟེ། །མགོན་མེད་རིང་ནས་སྐོམ་པ་ཚིམ་པར་གྱིས། །
en: Now let a rain of nectar fall To soothe the thirst of those who for so long have had no protector.

source: འཆི་མེད་མྱ་ངན་མེད་གནས་སངས་རྒྱས་ཏེ། །སྐོམ་པས་ཉམ་ཐག་བདུད་རྩིས་ཚིམ་བྱ་ཞེས། །ཁྱོད་ཀྱིས་སྔོན་སྨྲས་ཚིག་མཆོག་དྲན་བྱོས་ཏེ། །གྲོང་ཁྱེར་དམ་པ་འདི་ནས་མྱུར་དུ་བྱུང་།
en: “Now remember your supreme vow from the past: ‘I will leave behind this beautiful town, Quickly attain the state without death or sorrow, And satisfy those who suffer from thirst with the nectar of immortality.’

source: །ཁྱོད་ནི་ཤེས་རབ་མཆོག་གི་སྤྱོད་པ་མཁས།
en: “You are skilled in the supreme actions of knowledge;

source: ཁྱོད་ཀྱི་ཡེ་ཤེས་མཐའ་ཡས་དྲི་མེད་ཆེ། །རྨོངས་པ་ཡིད་གཉིས་ལམ་ལ་གནས་རྣམས་ལ། །ཤེས་རབ་འོད་དགེ་དམ་པ་མཛེས་པར་གྱིས།
en: Your wisdom is vast and limitless. So now, Virtuous One, shine the beautiful light of knowledge On those who are caught in delusion and doubt.

source: །ཁྱོད་ཀྱིས་སྲིད་པ་བརྒྱར་ནི་བྱམས་པ་སྤྱད།
en: “For hundreds of lives you have trained in love,

source: །སྙིང་རྗེ་དང་ནི་དགའ་མཆོག་བཏང་སྙོམས་དང་། །
en: As well as compassion, joy, and equanimity.

source: ཁྱོད་ཀྱིས་སྤྱོད་པ་དམ་པ་གང་སྤྱད་པ། །སྤྱོད་པ་དེ་ཉིད་འགྲོ་ལ་རྣམ་པར་ཕྱེ།
en: All those perfect acts that you have performed, You must now share with sentient beings.”

source: །ཕྱོགས་བཅུའི་རྒྱལ་བ་དག་གི་གཟི་བརྗིད་ཀྱིས།
en: Through all the splendor of the victorious ones in the ten directions,

source: །ཡོན་ཏན་མེ་ཏོག་སྣ་ཚོགས་ཚིགས་བཅད་འདི།
en: These verses, the wonderful blossoms of qualities, come about.

source: །སིལ་སྙན་དག་ལས་རྣམ་མང་ཡིད་འོང་གྲག །མལ་ན་འདུག་པའི་གཞོན་ནུ་དེ་ལ་སྐུལ།
en: Through music they reverberate beautifully, Encouraging the youth who rests on his couch.

source: །གང་གི་ཚེ་ན་དག་བུད་མེད་རབ་ཏུ་དགའ་བ་རྣམས།
en: At that time the joyful maidens who bring pleasure,

source: །ཤིན་ཏུ་མཛེས་ཤིང་རབ་ཏུ་སྙན་པའི་སིལ་སྙན་སྒྲོགས་པའི་ཚེ།
en: Beautiful as they are, play melodious tunes.

source: །ཕྱོགས་བཅུ་དག་གི་རྒྱལ་བ་ལྷ་མི་འདུལ་བ་མཛད་རྣམས་ཀྱང་།
en: At the same time the victorious ones in the ten directions, who tame gods and humans,

source: །སིལ་སྙན་དག་ལས་གསུང་མཆོག་ཧ་ཅང་མི་ཆེ་རྗེས་སུ་སྒྲོག །འགྲོ་ལ་ཕན་བྱེད་ཡོན་ཏན་མང་པོ་ལྡན་ཁྱོད་འགྲོ་རྣམས་སུ།
en: Let this perfect speech be heard through the instruments in a pleasant sound: “You, who benefit beings and possess many qualities,

source: །རྣམ་པར་རྒྱུ་བའི་ཚེ་ན་རྒྱལ་བའི་ཡོན་ཏན་གཉུག་མར་བྱས།
en: Have made the virtues of the victorious ones your own as you traveled the paths.

source: །སྔོན་གྱི་བརྟུལ་ཞུགས་དཀའ་ཐུབ་སྤྱད་པ་དེ་དག་དྲན་གྱིས་ཏེ།
en: Remember your past disciplined conduct and austerities;

source: །ཤིང་མཆོག་དྲུང་དུ་མྱུར་སོང་འཆི་མེད་གོ་འཕང་ཐོབ་པར་གྱིས།
en: Quick, go to the supreme tree and attain the state of immortality.

source: །ལྷ་མི་དག་ནི་ཤིན་ཏུ་སྐོམ་ཞིང་རྒྱལ་བའི་ཡོན་ཏན་བྲལ།
en: “Gods and humans are thirsty, lacking the qualities of the victorious ones;

source: །ཁྱོད་ནི་ཤིན་ཏུ་སྟོབས་ལྡན་བདུད་རྩིའི་རོ་བྲོ་རྟག་ཏུ་སྦྱིན།
en: Yet your resolve equals the task, so grant them the nectar of immortality.

source: །སྟོབས་བཅུའི་རོ་བྲོ་དམ་པ་མཁས་པ་རྣམས་ཀྱིས་མཆོད་བྱས་པ།
en: You possess the features of the ten powers, and all learned ones venerate you.

source: །བདུད་རྩི་དེ་ནི་མི་བདག་ཁྱོད་ཀྱིས་མྱུར་དུ་རྣམ་པར་ཕྱེ།
en: Quick, Lord of Men, dispense that nectar.

source: །རྒྱལ་བའི་ཡོན་ཏན་འགྲོ་ལ་ཕན་པ་བྱེད་ལ་དགའ་བ་པོ།
en: “You, Benefactor of the World, delight in the qualities of the victorious ones.

source: །ཁྱོད་ཀྱིས་སྔོན་གྱི་སྲིད་པར་ནོར་དང་ནོར་བུ་གསེར་རྣམས་བཏང་།
en: In your past lives you gave away your wealth, jewels, and gold;

source: །ཆུང་མ་བུ་སྡུག་དག་དང་གྲོང་ཁྱེར་གྲོང་རྡལ་བཅས་པ་དང་། །རང་གི་མགོ་དང་མིག་དང་ལག་པ་དག་དང་རྐང་པའང་བཏང་།
en: Your beloved wife and children; your land, cities, and villages; And even your own head, eyes, hands, and feet.

source: །མི་མཆོག་ཁྱོད་ནི་གནའ་སྔོན་རྒྱལ་པོ་དགེ་བར་གྱུར་པའི་ཚེ།
en: “O Best of Men, in former times you were a virtuous king.

source: །མི་ཞིག་ཁྱོད་ལ་མངོན་དུ་ཕྱོགས་ནས་འདི་སྐད་ཚིག་སྨྲས་ཏེ།
en: When a person came before you and said,

source: །གྲོང་ཁྱེར་གྲོང་རྡལ་བཅས་པའི་ས་འདི་ཁོ་ལ་བྱིན་ཞེས་བྱས།
en: ‘Please give me this land with its cities and villages,’

source: །དེ་ཡི་ཚེ་ན་རབ་ཏུ་དགའ་ཞིང་འཁྲུགས་པར་གྱུར་པ་མེད།
en: You gave it away with a happy and undisturbed mind.

source: །གནའ་སྔོན་ཁྱོད་ནི་རྒྱལ་པོའི་བྲམ་ཟེ་དགེ་བར་གྱུར་པའི་ཚེ།
en: “In former times you were a personal priest to a king;

source: །སྐྱེ་བོ་བླ་མ་བསྙེན་བཀུར་བྱེད་ཅིང་གཞན་ལ་འཁུ་མི་བྱེད།
en: You attended upon the masters and caused no harm to anyone.

source: །བྲམ་ཟེ་དམ་པ་དག་དང་སྐྱེ་བོ་མང་པོ་དགེ་ལ་བཀོད།
en: Best among priests, you established many ordinary beings in virtue;

source: །དེ་ནས་ཤི་འཕོས་སྲིད་པའི་འགྲོ་བ་ལྷ་ཡི་གནས་སུ་སྐྱེས།
en: After you died you were reborn in the divine realms.

source: །སྔོན་ཁྱོད་རྒྱལ་པོའི་བུ་ལས་དྲང་སྲོང་དམ་པར་གྱུར་པའི་ཚེ།
en: “Prince, in the past you were a perfect sage.

source: །རྒྱལ་པོ་ངན་པ་ཁྲོས་པས་ཁྱོད་ཀྱི་ཡན་ལག་བཅད་པ་ན།
en: At that time an evil king cut off your limbs in anger,

source: །ཁྱོད་ནི་ཡིད་འཁྲུགས་གྱུར་པ་མེད་པར་འཆི་བའི་དུས་བྱས་ཏེ།
en: Yet your mind remained undisturbed and you performed your caste duties.

source: །དེ་ཡི་ཚེ་ན་ཁྱོད་ཀྱི་རྐང་ལག་དག་ལས་འོ་མ་ཟག །
en: At that time milk flowed from your arms and legs.

source: ཁྱོད་སྔོན་དྲང་སྲོང་སྔོ་བསངས་ཞེས་བྱར་གང་ཚེ་གྱུར་པ་ན།
en: “In the past you were a sage’s son known as Śyāma;

source: །རི་མཆོག་གནས་ན་བརྟུལ་ཞུགས་དགའ་ཞིང་བླ་མ་ལ་ཡང་དགའ།
en: In the fine shelter of the mountains, you delighted in your difficult discipline.

source: །མི་ཡི་བདག་པོས་དུག་མདའ་དག་གིས་ཁྱོད་ལ་བསྣུན་པ་ན།
en: Yet when a ruler pierced you with his poisonous arrows,

source: །ཁྱོད་ནི་རྒྱལ་པོ་དེ་ལ་ཡིད་འཁྲུགས་མེད་ཅིང་སྙིང་བརྩེར་གྱུར།
en: You were not disturbed, and only felt pity for him.

source: །ཁྱོད་སྔོན་རི་དགས་བདག་པོ་ཡོན་ཏན་ཅན་དུ་གྱུར་པའི་ཚེ།
en: “In the past, O Receptacle of Qualities, when you were a leader of a pack of deer,

source: །རི་གཟར་འབབ་ཆུ་ཆེན་པོས་མི་ཞིག་ཁྱེར་བར་གྱུར་པ་ན།
en: A hunter was carried off by a raging mountain torrent. Wishing to help, you carried him to dry land.

source: །ཕན་དང་ལྡན་པ་ཁྱོད་ཀྱིས་མི་དེ་ཕྱུང་སྟེ་ཐང་ལ་བཞག །ཁྱོད་ཀྱི་དགྲ་བོ་ཁྲིད་དེ་འོངས་པ་ན་ཡང་ཡིད་མ་འཁྲུགས།
en: Even as you brought your enemy to safety, you remained calm.

source: །མི་མཆོག་ཁྱོད་སྔོན་བྲམ་ཟེའི་བུར་ནི་གང་ཚེ་གྱུར་པ་ན།
en: “Perfect Man, in previous times you were born as the son of a priest.

source: །ཁྱོད་ཀྱི་ནོར་བུ་རྒྱ་མཚོ་ཆེན་པོ་ཡངས་པར་ལྷུང་བའི་ཚེ།
en: When your gem fell in the ocean,

source: །ཁྱོད་ཀྱིས་རྒྱ་མཚོ་ཆེན་པོ་ཟད་པར་བྱ་བར་བརྩམས་པ་དང་། །སྟོབས་བརྟན་ཁྱུ་མཆོག་ཁྱོད་ཀྱི་ནོར་བུ་དེ་ཚེ་ཕྱིར་ཡང་རྙེད།
en: You dried out the ocean. As the strong and firm leader of human beings, you recovered the valuable gem.

source: །སྐྱེས་བུ་མཆོག་ཁྱོད་གནའ་སྔོན་དྲང་སྲོང་དམ་པར་གྱུར་པའི་ཚེ།
en: “Perfect Being, in times past you were born as a holy sage.

source: །བྲམ་ཟེ་ཞིག་གིས་བདག་གི་སྐྱབས་གྱུར་ཤོག་ཅེས་ཁྱོད་གན་འོངས། །
en: Once when a priest approached you, saying, ‘Please give me your protection,’

source: སྨྲས་པ་བྲམ་ཟེ་དམ་པ་ཁོ་བོ་དགྲ་ལས་བྱུང་ཞེས་བྱས།
en: Sage, you told him, ‘Venerable priest, I will rid you of the enemy.’

source: །ཁྱོད་ཀྱིས་རང་ལུས་བཏང་གིས་བྲམ་ཟེ་དེ་ནི་མ་བཏང་ངོ་།
en: You gave away your body, while the priest kept his.

source: །གནའ་སྔོན་ཤིང་གི་གནས་སུ་དྲང་སྲོང་སྔོ་བསངས་དྲུང་འོངས་ཏེ།
en: “In the past you approached the sage Śyāma at his place by the tree;

source: །འདོད་པས་སྨྲས་པ་ཤིང་འདི་ལོ་མ་དུ་ཡོད་གྲོངས་ཞེས་བྱས།
en: He asked you how many leaves were on the tree.

source: །ཤིང་དེ་ལོ་མ་ཇི་སྙེད་ཡོད་པ་རབ་བགྲངས་རབ་མཁས་པས།
en: With your skill you counted the leaves accurately

source: །ཁྱོད་ཀྱིས་དེ་བཞིན་ནོར་པ་མེད་ཅིང་འཐུན་པར་ཚིག་ཏུ་བརྗོད།
en: And told him the exact number.

source: །ཁྱོད་སྔོན་ནེ་ཙོ་ཡོན་ཏན་ལྡན་གྱུར་ཤིང་ལ་གནས་པའི་ཚེ།
en: “Previously you were a virtuous, quick-darting parrot that lived in a tree;

source: །ཟད་པར་གྱུར་ཀྱང་སྔོན་གྱི་དྲིན་ལ་བསམས་ཏེ་དེ་མ་སྤངས།
en: Although the tree died, you remained, remembering its kindness.

source: །ལྷ་ཡི་བདག་པོས་ཁྱོད་ཀྱི་ཡོན་ཏན་དྲན་ནས་རབ་ཏུ་དགའ།
en: The king of gods saw your virtues and rejoiced;

source: །སྔ་མཁོ་བཞིན་དུ་ཤིང་མཆོག་དེ་ནི་དཔལ་དང་ལྡན་པར་བྱས།
en: He restored the perfect tree to its former glory.

source: །ཁྱོད་ཀྱི་བརྟུལ་ཞུགས་དཀའ་ཐུབ་སྤྱད་པ་དེ་དག་མཚུངས་མེད་དེ།
en: “Your disciplined conduct and austerities are beyond compare;

source: །ཡོན་ཏན་ལྡན་པ་ཡོན་ཏན་ལམ་ལ་སྤྱད་པས་ཡོན་ཏན་མང་།
en: You are a receptacle of virtue, rich in qualities, treading the path of virtue.

source: །ཁྱོད་ཀྱི་དུས་ལ་ད་བབ་གྲོང་ཁྱེར་བཅས་པའི་ས་ཡང་ཐོང་།
en: Your time has come to abandon your city and your land;

source: །འགྲོ་བ་དག་ནི་རྒྱལ་བའི་ཡོན་ཏན་སྤྱོད་ལ་མྱུར་དུ་ཁོད།
en: Quick, establish beings in the virtuous actions of the victorious ones.”

source: །གང་གི་ཚེ་ན་བུད་མེད་རིན་ཆེན་བཟང་པོའི་གོས་ཀྱིས་ལུས་བརྒྱན་ཏེ།
en: When gems of playful women, exquisitely dressed, their bodies adorned,

source: །སིལ་སྙན་དམ་པ་མཆོག་རབ་ཡིད་དུ་འོང་བའི་སྒྲ་ནི་རབ་སྒྲོག་པ།
en: Play sweet music on the best of instruments,

source: །དེ་ཚེ་ཕྱོགས་བཅུའི་རྒྱལ་བའི་གཟི་ཡིས་ཚིགས་སུ་བཅད་པ་སྣ་ཚོགས་པ།
en: Then, by the glory of the victorious ones in the ten directions,

source: །སྒྲ་དབྱངས་སྙན་པ་འདི་དག་སིལ་སྙན་དག་གི་སྒྲ་ལས་རབ་ཏུ་བྱུང་།
en: These wonderful verses emerge from the beautiful sounds of the instruments:

source: །རྒ་དང་ཤི་བས་ཟིན་པའི་འཇིག་རྟེན་དག་ལ་བདག་ནི་སྐྱབས་གྱུར་ཅེས།
en: “You vowed, ‘I will be the protector of the world plagued by old age and death.’

source: །འཇིག་རྟེན་སྒྲོན་མ་ཁྱོད་ཀྱིས་བསྐལ་མང་སྔ་རོལ་སྨོན་ལམ་དེ་སྐད་བཏབ།
en: Light of the World, in times past, for many eons, you have made this wish.

source: །མི་ཡི་སེང་གེ་ཁྱོད་ཀྱིས་སྔོན་གྱི་སྨོན་ལམ་དག་ནི་དྲན་གྱིས་ཤིག །རྐང་གཉིས་དབང་པོ་ཁྱོད་ད་མངོན་པར་འབྱུང་བའི་དུས་ནི་འདི་ཡིན་ནོ།
en: Lion of Men, remember your past aspirations; Lord of Men, this is your time for renouncing your home.

source: །ཁྱོད་འདིར་སྲིད་པ་ཁྲག་ཁྲིག་དག་ཏུ་སྦྱིན་པ་མང་པོ་དུ་མ་བྱིན།
en: “For billions of lives, you generously made many lavish gifts,

source: །ནོར་དང་རིན་པོ་ཆེ་དང་གསེར་དང་གོས་བཟང་རིན་ཆེན་སྤྲས་པ་དང་། །རྐང་ལག་དག་དང་མིག་དང་ཕངས་པའི་བུ་དང་རྒྱལ་སྲིད་འབྱོར་པ་དག །ཁྱོད་ཀྱིས་བཏང་ཡང་ཁྱོད་ནི་སློང་བ་རྣམས་ལ་ཐ་བ་ཞེ་སྡང་མེད།
en: Giving away your wealth, gems, gold, fine cloth, a variety of jewels, Your hands, feet, eyes, your beloved child, and the wealth of your kingdom. Still you never had any resentment or anger for those who took it.

source: །ཁྱོད་འདིར་ཟླ་བའི་ཏོག་དང་མཆེ་བ་བཟང་དང་རྒྱལ་པོ་ཞི་བར་གྱུར།
en: “You, Śaśiketu, have been a peaceful king with fine teeth,

source: །སྙིང་བརྩེ་སྙིང་རྗེའི་ཡིད་དང་ཟླ་བའི་སྒྲོན་དང་གཙུག་ན་ནོར་བུར་གྱུར།
en: Loving and compassionate, with a crown jewel shining like the moon.

source: །རྒྱལ་པོ་དཔའ་བོ་བརྟན་དང་མིག་བཟངས་དང་ནི་དེ་ལ་སོགས་པ་བྱས།
en: Such were your main deeds, mighty hero with the beautiful eyes of a king.

source: །རྒྱལ་པོ་ཁྲག་ཁྲིག་མང་པོ་སྦྱིན་དགའ་རྣམ་པར་འཕྲུལ་པ་དེ་ཉིད་ཁྱོད།
en: As a king, for billions of years you have practiced generosity gladly.

source: །བདེ་བར་གཤེགས་པ་ཁྱོད་ཀྱིས་བསྐལ་པ་མང་པོར་ཚུལ་ཁྲིམས་སྤྱོད་པ་སྤྱད།
en: “Thus-Gone One, for many eons you have practiced discipline.

source: །ནོར་བུ་རིན་ཆེན་དྲི་མ་མེད་པ་ལྟ་བུར་ཚུལ་ཁྲིམས་རྣམ་དག་གྱུར།
en: Like a stainless jewel, your discipline has been pure;

source: །ཁྱོད་ཀྱིས་འབྲི་ཡི་རྔ་མ་ཅི་འདྲ་དེ་འདྲར་ཚུལ་ཁྲིམས་བསྲུངས་ཤིང་སྤྱད།
en: Like a female yak that protects her calf, you have guarded your discipline.

source: །ཚུལ་ཁྲིམས་དགའ་བས་ཁྱོད་ཀྱིས་འདིར་ནི་འགྲོ་ལ་རྒྱ་ཆེར་དོན་ཡང་བྱས།
en: Since you delight in discipline, you have done so much to benefit beings.

source: །འདིར་ཁྱོད་གླང་པོ་མཆོག་ཏུ་གྱུར་ཏེ་རྔོན་པ་དགྲ་ཡིས་མདས་བསྣུན་ཚེ།
en: “As a perfect elephant, the arrows of the evil hunter hit you,

source: །གཏུམ་པོ་དགྲ་ལ་སྙིང་བརྩེ་སྙིང་རྗེ་བསྐྱེད་ནས་དེ་ནི་ཁྱོད་ཀྱིས་བསྐྱབས།
en: Yet you felt love and compassion for this harsh enemy and protected him.

source: །བཟང་ཞིང་མཛེས་པའི་མཆེ་བ་ཡོངས་སུ་བཏང་སྟེ་ཚུལ་ཁྲིམས་ཡོང་མ་བཏང་།
en: You gave him your fine and beautiful tusks and did not relinquish your discipline;

source: །ཁྱོད་ཀྱིས་དེ་ལ་སོགས་པ་ཚུལ་ཁྲིམས་རྣམ་པར་འཕྲུལ་པ་མང་པོ་བྱས།
en: You displayed such discipline many times.

source: །བཟོད་ལ་དགའ་བས་ཁྱོད་ཀྱིས་འགྲོ་བའི་མི་ཕན་སྡུག་བསྔལ་སྟོང་མང་དང་། །ཚིག་རྩུབ་ངག་དང་བསད་པ་དང་ནི་བཅིང་བ་མང་པོ་བཟོད་པར་བྱས།
en: “Delighting in forbearance, you had patience with the many harms, sufferings, Harsh words, murders, and imprisonments inflicted upon you by others.

source: །ཁྱོད་ཀྱིས་གནའ་སྔོན་མི་གང་དག་ལ་བདེ་བ་ཀུན་གྱིས་རིམ་གྲོར་བྱས།
en: In the past you always provided others with every comfort,

source: །དེ་དག་ཕྱི་ནས་ཁྱོད་ཀྱི་གཤེད་མར་གྱུར་ཀྱང་ཁྱོད་ཀྱིས་དེ་དག་བཟོད།
en: And although they were your executioners, you still remained forbearing.

source: །མགོན་པོ་ཁྱོད་ནི་རི་མཆོག་གནས་ན་གང་ཚེ་དྲེད་མོར་གྱུར་པའི་ཚེ།
en: “Protector, once you were a bear, living in a mountain lair;

source: །ཁ་བ་བབ་ཅིང་ཆུ་བྲུག་པས་ནི་འཇིགས་ཤིང་སྐྲག་པའི་མི་བཟུང་སྟེ།
en: At that time you rescued a man, frightened and terrified, out of an avalanche.

source: །རྩ་བ་འབྲས་བུ་རྣམ་པ་མང་དང་བདེ་བ་ཀུན་གྱིས་རིམ་གྲོ་བྱས།
en: You served him roots and berries and provided him with every comfort;

source: །དེ་ཡིས་མྱུར་དུ་ཁྱོད་ལ་གསོད་པ་ཁྲིད་འོངས་ཁྱོད་ཀྱིས་དེ་ལ་བཟོད།
en: Although he soon killed you and carried you off, you remained patient.

source: །བྱང་ཆུབ་བཙལ་ཕྱིར་བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཡོན་ཏན་རྣམ་མང་ཡེ་ཤེས་ལ།
en: “When through austerities, you sought awakening and wisdom of many qualities,

source: །ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་ཤིན་ཏུ་བརྟན་པར་གནས་ཤིང་མི་གཡོ་གཡོ་བ་མེད།
en: You possessed fortitude, determination, unshakable resolve, and diligence;

source: །དབང་སྒྱུར་བདུད་ཀྱང་ཁྱོད་ཀྱིས་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་སྟོབས་ནི་མེད་པར་བྱས།
en: The strength of your diligence could overcome even the most powerful demon.

source: །མི་ཡི་སེང་གེ་ཁྱོད་འདིར་མངོན་པར་འབྱུང་བའི་དུས་ལ་ད་བབ་བོ།
en: Lion of Men, the time has come for renunciation.

source: །ཁྱོད་འདིར་གནའ་སྔོན་ཁ་བའི་ཁ་དོག་འདྲ་བའི་རྟ་མཆོག་གྱུར་པའི་ཚེ།
en: “In the past you were the finest of horses, as white as snow;

source: །སྙིང་རྗེ་བསྐྱེད་ནས་ནམ་མཁའ་ལས་ནི་སྲིན་པོའི་གླིང་དུ་མྱུར་དུ་སོང་།
en: With compassion, you traveled swiftly through the sky to the land of demonesses.

source: །དེ་ཚེ་ཕོངས་ཤིང་འདུག་པའི་མི་དེ་བླངས་ཏེ་བདེ་ལ་རབ་ཏུ་བཞག ། ཁྱོད་ཀྱིས་འདི་ལ་སོགས་པ་བརྩོན་འགྲུས་རྣམ་པར་འཕྲུལ་པ་མང་པོ་བྱས།
en: You rescued the men in distress and brought them to safety; Many times have you demonstrated such diligence.

source: །མྱུར་དུ་འགྱུར་ཞིང་གཡོ་ལ་ཡུལ་ལ་དགའ་ཞིང་རྒོད་པའི་སེམས་བརྟུལ་ཏེ། །བསམ་གཏན་པར་གྱུར་དུལ་དེས་ཞི་གནས་རྣམས་ཀྱིས་ཉོན་མོངས་གཙོ་བོ་བཅོམ།
en: “A skilled meditator, you destroyed afflictions with calmness, discipline, and restraint, And tamed the fickle mind, which chases after the pleasures of the senses.

source: །ཁྱོད་འདིར་བསམ་གཏན་དགའ་བས་རང་གི་ཡོན་ཏན་དག་གིས་འགྲོ་དོན་བྱས།
en: Since you delight in concentration, your personal qualities benefit others;

source: །ད་འདིར་སེམས་ཅན་མཆོག་ཁྱོད་བསམ་གཏན་རྣམ་འཕྲུལ་བྱ་བའི་དུས་ལ་བབ།
en: Now, Perfect Being, the time has come for you to demonstrate your concentration.

source: །གནའ་སྔོན་ཁྱོད་ནི་དྲང་སྲོང་བསམ་གཏན་དགའ་ཞིང་རབ་ཏུ་གནས་པར་གྱུར།
en: “In the past you were a well-to-do sage who delighted in concentration;

source: །རྒྱལ་པོ་མེད་པའི་མི་དག་གིས་ནི་ཁྱོད་ཁྲིད་རྒྱལ་སྲིད་དབང་ཡང་བསྐུར།
en: People who had lost their king invited you and consecrated you to kingship.

source: །ཁྱོད་ཀྱིས་སྐྱེ་བོ་དག་ནི་དགེ་བ་བཅུ་དང་ཚངས་པའི་ལམ་ལ་བཀོད།
en: You showed these people the ten virtues and established them on the path of Brahmā;

source: །དེ་ཡི་ཚེ་ན་མི་ལས་ཤི་འཕོས་ཐམས་ཅད་ཚངས་པའི་གནས་སུ་དོང་།
en: Later, as they died, they all proceeded to the realm of Brahmā.

source: །ཕྱོགས་དང་ཕྱོགས་མཚམས་འགྲོ་བ་རྣམ་མང་ཤེས་པའི་ཆོ་ག་ཁྱོད་རབ་མཁས།
en: “You have mastered the art of knowing the destinies of beings in all directions;

source: །གཞན་གྱི་སྤྱོད་དང་འགྲོ་བའི་སྐད་ཤེས་པ་དང་དབང་པོ་ཤེས་པ་དང་། །ཚུལ་དང་འདུལ་དང་བློ་གྲོས་རྣམ་མང་རྒྱུ་བའི་ཕ་རོལ་ཁྱོད་ཕྱིན་གྱུར།
en: You know their actions, languages, and capacities. You have perfected the way, the discipline, and different types of memory;

source: །རྒྱལ་པོའི་སྲས་ཁྱོད་འདིར་ནི་མངོན་པར་འབྱུང་བའི་དུས་ལ་ད་བབ་བོ།
en: Royal Son, today the time for renunciation has come.

source: །ཁྱོད་ཀྱིས་གནའ་སྔོན་སྐྱེ་བོ་ལྟ་བ་ལོག་པར་ཞུགས་པར་གྱུར་པ་དག །རྒ་ཤི་སྡུག་བསྔལ་རྣམ་པ་མང་པོས་ཉམ་ཐག་འཁོད་པ་འདི་མཐོང་ནས།
en: “In the past, when you saw anyone with wrong views, Who suffered from old age, death, and all the different afflictions,

source: །སྲིད་པ་རྣམ་པར་གཞིག་པའི་དྲང་ལམ་ཉིད་ཀྱིས་ཁོང་དུ་ཆུད་བྱས་ཏེ།
en: You instructed them in the straight path that destroys existence.

source: །མུན་པ་བཅོམ་པ་ཁྱོད་ཀྱིས་འཇིག་རྟེན་དག་ལ་དོན་ཆེན་རབ་ཏུ་བྱས།
en: You who conquer darkness, you have benefited the world greatly.”

source: །ཚིགས་བཅད་རྣམ་པ་མང་པོ་མཛེས་པ་ཡོན་ཏན་ལྡན་པ་སྣ་ཚོགས་འདིས།
en: These many virtuous and beautiful verses emerge from the tune of the instruments;

source: །སིལ་སྙན་སྒྲ་བསྒྲགས་དེ་ལས་རྒྱལ་བའི་གཟི་ཡིས་དཔའ་བོ་སྐུལ་བར་གྱུར།
en: By the glory of the victorious ones, they encourage the hero:

source: །བློ་མཆོག་ལྡན་པ་ཁྱོད་འདིར་མངོན་པར་འབྱུང་བའི་དུས་ནི་ད་བབ་ཀྱིས།
en: “Intelligent One, the time for renunciation has come;

source: །སྡུག་བསྔལ་གང་བའི་སྐྱེ་བོ་འདི་དག་མཐོང་ནས་བཏང་སྙོམས་མ་བྱེད་ཅིག །བུད་མེད་གོས་དང་རིན་པོ་ཆེ་དང་དོ་ཤལ་སྤོས་ཕྲེང་སྣ་ཚོགས་ཀྱིས། །བརྒྱན་པ་དག་ཀྱང་སེམས་དང་ཕངས་པ་སྐྱེས་ནས་རབ་ཏུ་དགའ་བ་རྣམས།
en: When you see these suffering beings, do not remain indifferent.” The pleasing and joyful women are adorned With fine clothes, gems, necklaces, perfumes, and flower garlands;

source: །སེམས་ཅན་མཆོག་ལ་སིལ་སྙན་རབ་ཏུ་སྒྲོག་ཅིང་སློང་བར་བྱེད་པ་ན།
en: They wake the Supreme Being with music and song.

source: རྒྱལ་བའི་མཐུ་ཡིས་སིལ་སྙན་དག་ལས་ཚིགས་སུ་བཅད་པ་འདི་འདྲ་བྱུང་།
en: By the power of the victorious ones, the instruments call out these verses:

source: །གང་གི་དོན་དུ་ཁྱོད་ཀྱིས་འགྲོ་ལ་ཕན་ཕྱིར་བསྐལ་པ་དུ་མར་ནི།
en: “It was for the sake of others that for many eons

source: །གཏང་བར་དཀའ་བ་བཏང་ཞིང་ཚུལ་ཁྲིམས་བཟོད་པ་བརྩོན་འགྲུས་ཤིན་ཏུ་སྤྱད།
en: You gave up what is hard to abandon and were disciplined, forbearing, and diligent.

source: །བསམ་གཏན་ཤེས་རབ་ཤིན་ཏུ་བསྒོམས་པ་ཁྱོད་ཀྱིས་དུས་ལ་ད་བབ་ཀྱིས།
en: Through your training in concentration and knowledge, your time has come;

source: །འདྲེན་པ་མངོན་པར་འབྱུང་བའི་བློ་ལ་མྱུར་སོམས་ཕྱིར་ཤོལ་མ་བྱེད་ཅིག །སྔོན་ཆད་རིན་ཆེན་མཛོད་དང་གསེར་དང་དངུལ་དང་རྒྱན་རྣམས་རབ་ཏུ་བཏང་།
en: Guide, quick, direct your mind toward renunciation, without delay! “Before you relinquished treasuries of jewels, gold, silver, and ornaments;

source: །སྐྱེ་བ་དེ་དང་དེ་དག་ཏུ་ནི་མཆོད་སྦྱིན་རྣམ་པ་མང་པོ་བྱས།
en: In all those lives, you performed sacrifices of many types.

source: །ཁྱོད་ཀྱིས་ཆུང་མ་བུ་ཕོ་བུ་མོ་ལུས་དང་རྒྱལ་སྲིད་སྲོག་བཏང་སྟེ།
en: You gave away your wife, sons, daughters, body, kingdom, and even your life;

source: །བྱང་ཆུབ་དོན་དུ་གཏང་བར་དཀའ་བ་དཔག་ཏུ་མེད་པ་ཁྱོད་ཀྱིས་བཏང་།
en: For the sake of awakening, you gave away without limits what is hard to abandon.

source: །ཁྱོད་ནི་རྒྱལ་པོ་མི་དམན་བསོད་ནམས་དཔལ་གྱིས་རྣམ་པར་གྲགས་པར་གྱུར།
en: “You have been kings rich in merit and renowned for splendor:

source: །མུ་ཁྱུད་འཛིན་དང་མུ་ཁྱུད་ནག་པོ་ཚངས་པས་བྱིན་དང་རལ་པ་ཅན།
en: Nimindhara, Nimi, Kṛṣṇabandhu, Brahmadatta, Keśarin,

source: །མཆོད་སྦྱིན་སྟོང་ལྡན་དང་ནི་ཆོས་སེམས་འོད་འཕྲོ་ཅན་དང་ནོར་བརྟན་དང་། །ཤིན་ཏུ་དོན་བསམས་གྱུར་ཏེ་སེམས་ཅན་དམན་ལ་གཏང་བར་དཀའ་བ་བཏང་།
en: Sahasrayajña, Dharmacinti, Arcimat, and Dṛḍhadhanu. Always considering the matter well, you gave to lowly people what is hard to give.

source: །ཟླ་བའི་བུ་དང་བརྩོན་འགྲུས་འབར་དང་བསོད་ནམས་འོད་ཟེར་ཅན་དུ་གྱུར།
en: “You have been powerful Sutasoma, Dīptavīrya, and Puñyaraśmi;

source: །གཏོང་བ་ཆེ་དང་ལྡན་ཞིང་མཐུ་ལྡན་ཁྱོད་ནི་བྱས་པ་གཟོ་བར་གྱུར།
en: Generous and powerful, you also acknowledged the kindness of others.

source: །རྒྱལ་པོ་དྲང་སྲོང་ཟླ་བ་གཟུགས་ལྡན་དཔའ་བོ་བདེན་པ་འཕེལ་བ་དང་། །རྒྱལ་པོ་ལེགས་པར་སྨྲ་བ་ཚོལ་དང་བློ་གྲོས་བཟང་དང་དེས་པར་གྱུར།
en: O Royal Sage, you were the moon-like hero Satyavardhana, The king Subhāṣita­gaveṣin, and the gentle Sumati.

source: །ཟླ་བའི་འོད་དང་ཁྱད་པར་འགྲོ་དང་རྡུལ་དང་ཕྱོགས་ཀྱི་བདག་པོར་གྱུར།
en: “You have been Candraprabha, Viśeṣagāmin, and Reṇu, lord of the ten directions;

source: །རབ་སྦྱིན་དཔའ་བོ་ཀ་ཤི་རྒྱལ་པོ་རིན་ཆེན་གཙུག་ཕུད་ཞི་བ་སྟོན།
en: You have been the king of Kāśi, Pradānasūra, Ratnacūḍa, and Śāntaga.

source: །མི་དབང་དེ་དག་རྣམས་དང་གཞན་དུ་གྱུར་ཏེ་གཏང་བར་དཀའ་བ་བཏང་།
en: When you were these rulers, as well as others, you gave what is hard to give;

source: །ཁྱོད་ཀྱིས་ཇི་ལྟར་གཏོང་བའི་ཆར་ཕབ་དེ་བཞིན་ཆོས་ཀྱི་ཆར་པ་ཕོབ།
en: As you showered a rain of gifts then, may you now shower a rain of Dharma.

source: །ཁྱོད་ཀྱིས་སྔོན་ཆད་སེམས་ཅན་སྙིང་པོ་གང་གཱའི་བྱེ་མ་སྙེད་ཅིག་མཐོང་། །སེམས་ཅན་ཐར་བར་བྱ་ཕྱིར་བྱང་ཆུབ་དམ་པའི་མཆོག་ནི་ཚོལ་བ་ན། །ཁྱོད་ཀྱིས་མཆོད་པ་དཔག་མེད་བསམ་མི་ཁྱབ་པས་སངས་རྒྱས་དེ་དག་མཆོད། །དཔའ་བོ་གྲོང་ཁྱེར་དམ་པ་འདི་ནས་འབྱུང་བའི་དུས་ལ་ད་བབ་བོ།
en: “In the past you saw the best of beings, as numerous as sand in the Ganges, And made an inconceivable and limitless number of offerings to them. As you searched for supreme awakening in order to liberate others then, Hero, now the time has come to renounce this perfect city.

source: །ཐོག་མར་ཁྱོད་ཀྱིས་དོན་ཡོད་མཐོང་ལ་སཱ་ལའི་མེ་ཏོག་གིས་ནི་མཆོད།
en: “At the beginning you offered Amoghadarśin a sāl flower;

source: །རྣམ་པར་སྣང་མཛད་ལ་ནི་དང་བའི་སེམས་ཀྱིས་སྐད་ཅིག་རབ་ཏུ་བལྟས།
en: With a mind full of devotion, you gazed for a moment at Vairocana.

source: །རྔ་དབྱངས་ལྡན་པ་ལ་ནི་ཁྱོད་ཀྱིས་ཨ་རུ་ར་ཡི་འབྲུ་ཅིག་ཕུལ།
en: You offered Dundubhisvara a myrobalan fruit;

source: །ཙན་དན་མཐོང་ནས་ཁྱོད་ཀྱིས་རྩྭ་ཡི་མེ་སྒྲོན་བླངས་ཏེ་ཁྱིམ་དུ་བཟུང་། །རྟུལ་པོ་གྲོང་ཁྱེར་འཇུག་པ་མཐོང་ནས་ཕྱེ་མ་སྤར་གང་རབ་ཏུ་གཏོར།
en: When you saw Candana’s house, you brought your grass torch and held it up. “When Reṇu entered the city, you scattered a handful of fragrant powder at him;

source: །ཆོས་ཀྱི་དབང་ཕྱུག་ཆོས་འཆད་པ་ན་ལེགས་ཞེས་བྱ་བ་རབ་ཏུ་བྱིན།
en: When Dharmeśvara taught the Dharma, you applauded him.

source: །ཀུན་ཏུ་གཟིགས་པ་མཐོང་ནས་ཕྱག་འཚལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་ཏུ་བརྗོད།
en: When you saw Samantadarśin, you declared your homage to him;

source: །འོད་འཕྲོ་ཆེན་པོའི་ཕུང་པོ་ལ་ནི་ཁྱོད་ཀྱིས་དགའ་བས་གསེར་ཕྲེང་གཏོར།
en: You joyfully threw a golden chain toward Mahārciskandhin.

source: །འོད་ཟེར་རྒྱལ་མཚན་ལ་ནི་ཁ་ཚར་ཕུལ་ཞིང་གསལ་ལ་བལ་སྲན་གཏོར།
en: “To Dharmadhvaja you offered a robe, and to Nirodha a handful of beans.

source: །ཡེ་ཤེས་ཏོག་ལ་མྱ་ངན་མེད་པའི་མེ་ཏོག་ཁ་ལོ་སྒྱུར་ལ་འཇམ།
en: You offered Jñānaketu a flower of the aśoka tree, and soup to Sārathi.

source: །རིན་ཆེན་གཙུག་ཏོར་ཅན་ལ་མར་མེ་པད་མ་ལྡན་ལ་སྨན་ཡང་ཕུལ།
en: You offered a candle to Ratnaśikhin, and medicine to Padmayoni.

source: །ཐམས་ཅད་ཟིལ་གནོན་མུ་ཏིག་དོ་ཤལ་རྒྱ་མཚོ་ལ་ནི་པད་མ་ཕུལ།
en: To Sarvābhibū you offered a pearl necklace, and to Sāgara a lotus flower.

source: །པད་མའི་སྙིང་པོ་ལ་ནི་བླ་རེ་སེང་གེ་ལ་ནི་ཆར་གདིང་ཕུལ།
en: “You offered a canopy to Padmagarbha, and a rain cover to Siṃha.
